import React from 'react'
import { Title } from '../components/helpers/Title'

const PrivacyPolicy = () => {
    return (
        <div className="reletive w-full bg-sand-500/20 pt-28 px-6 md:px-16 lg:px-24 xl:px-32 pb-16">
            {/* Title */}
            <div className='pt-12'>
                <Title text="**ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ**" color="black" />
            </div>

            {/* Marquee Container */}
            <div className="pt-12"></div>

            {/* Content Container */}
            <div className="border border-borderColor rounded-xl bg-white shadow-sm transition mb-2">
                <div className='px-2 py-2'>
                    <p>Останнє оновлення: 26 листопада 2025 року</p>
                    <p>Ця Політика конфіденційності визначає порядок збору, обробки, зберігання та захисту персональних даних користувачів вебсайту «162-ОМбр» (далі — «Сайт»). Використовуючи Сайт, ви підтверджуєте свою згоду з цією Політикою та умовами обробки ваших даних.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **1. Загальні положення**</p>
                    <br />
                    <p>1.1. Адміністратором персональних даних є команда розробки проєкту «162-ОМбр».</p>
                    <p>1.2. Політика розроблена відповідно до Закону України «Про захист персональних даних» та інших чинних нормативно-правових актів.</p>
                    <p>1.3. Використання Сайту означає, що користувач погоджується з умовами цієї Політики. Якщо ви не погоджуєтесь — припиніть користування Сайтом.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **2. Які дані ми збираємо**</p>
                    <br />
                    <p>2.1. **Персональні дані**, які ви можете добровільно надати:</p>
                    <p>- ім’я та прізвище;</p>
                    <p>- номер телефону;</p>
                    <p>- електронна пошта;</p>
                    <p>- інформація, що передається у заявці на консультацію або запис.</p>
                    <br />
                    <p>2.2. **Технічні дані**, що збираються автоматично:</p>
                    <p>- IP-адреса;</p>
                    <p>- дані про пристрій та браузер;</p>
                    <p>- cookies;</p>
                    <p>- дані про переглянуті сторінки.</p>
                    <br />
                    <p>2.3. Ми не збираємо та не обробляємо спеціальні категорії даних, такі як медичні, біометричні чи чутливі військові відомості.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **3. Мета обробки персональних даних**</p>
                    <br />
                    <p>Ми обробляємо ваші дані для таких цілей:</p>
                    <br />
                    <p>- забезпечення можливості подання заявки на службу;</p>
                    <p>- комунікація з користувачами;</p>
                    <p>- надання доступу до інформаційних матеріалів;</p>
                    <p>- поліпшення якості роботи Сайту;</p>
                    <p>- забезпечення безпеки та запобігання шахрайству;</p>
                    <p>- аналітика та оптимізація функціоналу.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **4. Правові підстави обробки**</p>
                    <br />
                    <p>4.1. Згода суб’єкта персональних даних.</p>
                    <p>4.2. Необхідність виконання запиту користувача.</p>
                    <p>4.3. Законний інтерес адміністратора — забезпечення стабільної роботи Сайту.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **5. Передача персональних даних третім особам**</p>
                    <br />
                    <p>5.1. Дані можуть передаватися:</p>
                    <p>- державним органам — лише за наявності законних підстав (наприклад, на вимогу правоохоронних органів);</p>
                    <p>- підрядникам, що обслуговують Сайт (хостинг, аналітика).</p>
                    <br />
                    <p>5.2. Ми не передаємо та не обмінюємо ваші дані з будь-якими маркетинговими чи комерційними структурами.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **6. Зберігання даних**</p>
                    <br />
                    <p>6.1. Термін зберігання — не довше, ніж це необхідно для виконання мети обробки.</p>
                    <p>6.2. Дані заявок зберігаються до 12 місяців. </p>
                    <p>6.3. Технічні журнали — до 24 місяців.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **8. Захист даних**</p>
                    <br />
                    <p>Ми застосовуємо такі заходи безпеки:</p>
                    <br />
                    <p>- шифрування даних при передачі;</p>
                    <p>- захист серверів та інфраструктури;</p>
                    <p>- контроль доступів до даних;</p>
                    <p>- політика мінімізації та обмеження доступу.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **9. Cookies**</p>
                    <br />
                    <p>Сайт використовує файли Cookies для:</p>
                    <br />
                    <p>- забезпечення роботи інтерфейсу;</p>
                    <p>- збереження налаштувань користувача;</p>
                    <p>- аналітики та статистики.</p>
                    <br />
                    <p>Користувач може відключити cookies у налаштуваннях браузера.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **10. Відповідальність**</p>
                    <br />
                    <p>Ми не несемо відповідальності за:</p>
                    <br />
                    <p>- дії третіх осіб, що отримують дані через мережу Інтернет;</p>
                    <p>- збої в роботі інтернет-провайдерів;</p>
                    <p>- зовнішні сервіси, на які ведуть посилання з нашого Сайту.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **11. Зміни до Політики**</p>
                    <br />
                    <p>11.1. Ми можемо оновлювати цю Політику у разі зміни законодавства або функціоналу Сайту.</p>
                    <p>11.2. Нова версія набирає чинності з моменту публікації.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>## **12. Контакти**</p>
                    <br />
                    <p>З усіх питань щодо обробки персональних даних ви можете звертатися через форму зворотного зв’язку на Сайті.</p>
                    <br />
                </div>
            </div>
        </div>
    )
}

export default PrivacyPolicy