import React from 'react'
import { Title } from '../components/helpers/Title'

const ProcessingData = () => {
    return (
        <div className="reletive w-full bg-sand-500/20 pt-28 px-6 md:px-16 lg:px-24 xl:px-32 pb-16">
            {/* Title */}
            <div>
                <Title text="**ОБРОБКА ПЕРСОНАЛЬНИХ ДАНИХ**" color="black" />
            </div>

            {/* Marquee Container */}
            <div className="pt-24"></div>

            {/* Content Container */}
            <div className="border border-borderColor rounded-xl bg-white shadow-sm transition mb-2">
                <div className='px-2 py-2'>
                    <p className='font-semibold'>**1. Загальні положення**</p>
                    <br />
                    <p>Ця сторінка визначає порядок та умови обробки персональних даних користувачів, які подають заявки, надсилають інформацію або взаємодіють із вебпорталом «162- ОМБр» (далі — «Портал»).</p>
                    <p>Обробка персональних даних здійснюється відповідно до Закону України «Про захист персональних даних» та іншого чинного законодавства.</p>
                    <p>Використовуючи Портал, користувач підтверджує свою згоду на обробку персональних даних у межах, визначених цією Політикою.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**2. Мета збирання та обробки персональних даних**</p>
                    <br />
                    <p>Обробка персональних даних здійснюється виключно з такими цілями:</p>
                    <p>— забезпечення можливості подання заявки на проходження служби;</p>
                    <p>— комунікація з кандидатами, включно з уточненням даних та інформуванням щодо етапів розгляду заявки;</p>
                    <p>— верифікація особи та підтвердження поданої інформації;</p>
                    <p>— ведення статистики та удосконалення роботи Порталу;</p>
                    <p>— забезпечення кібербезпеки, запобігання шахрайству та несанкціонованому доступу.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**3. Склад та види даних, що обробляються**</p>
                    <br />
                    <p>Портал може збирати такі категорії персональних даних користувача:</p>
                    <p>— прізвище, імʼя, по батькові;</p>
                    <p>— контактні дані (телефон, електронна пошта);</p>
                    <p>— дата народження;</p>
                    <p>— інформація про досвід служби або роботи;</p>
                    <p>— дані, надані у формі заявки;</p>
                    <p>— додаткові відомості, які користувач добровільно надає для проходження рекрутингу.</p>
                    <br />
                    <p>Портал **не збирає** фінансову інформацію користувачів та не здійснює обробку спеціальних категорій даних, окрім тих, що прямо необхідні для проведення відбору на службу відповідно до чинного законодавства України.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**4. Підстави для обробки даних**</p>
                    <br />
                    <p>Персональні дані користувача обробляються на таких правових підставах:</p>
                    <p>— добровільна згода користувача;</p>
                    <p>— необхідність виконання завдань, пов’язаних з рекрутингом до підрозділів Збройних Сил України;</p>
                    <p>— виконання вимог законодавства України;</p>
                    <p>— забезпечення функціонування Порталу та підвищення його безпеки.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**5. Термін та місце зберігання персональних даних**</p>
                    <br />
                    <p>Персональні дані зберігаються протягом періоду, необхідного для реалізації цілей, зазначених у розділі 2, але не довше, ніж це передбачено законом.</p>
                    <p>Дані зберігаються у захищених інформаційних системах, доступ до яких обмежений та здійснюється виключно уповноваженими особами.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**6. Передача персональних даних третім особам**</p>
                    <br />
                    <p>Портал може передавати персональні дані виключно:</p>
                    <p>— підрозділам Збройних Сил України та іншим компетентним органам, відповідальним за відбір кандидатів;</p>
                    <p>— уповноваженим державним органам у випадках, прямо передбачених законом;</p>
                    <p>— постачальникам технічних послуг (хостинг, кіберзахист), за умови дотримання ними конфіденційності.</p>
                    <br />
                    <p>Портал **не продає та не передає** персональні дані комерційним організаціям.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**7. Права користувача**</p>
                    <br />
                    <p>Користувач має право:</p>
                    <p>— отримувати інформацію про обробку своїх персональних даних;</p>
                    <p>— вимагати внесення змін або уточнення даних;</p>
                    <p>— відкликати згоду на обробку даних;</p>
                    <p>— вимагати припинення обробки та видалення даних, якщо це не суперечить законодавству;</p>
                    <p>— подавати скарги до Уповноваженого Верховної Ради України з прав людини.</p>
                    <br />
                    <p>Для реалізації цих прав користувач може звернутися через контактні дані, зазначені на Порталі.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**8. Захист персональних даних**</p>
                    <br />
                    <p>Портал впроваджує необхідні технічні та організаційні заходи для запобігання:</p>
                    <p>— несанкціонованому доступу;</p>
                    <p>— втраті, знищенню або пошкодженню даних;</p>
                    <p>— зміні або використанню даних третіми особами без законних підстав.</p>
                    <br />
                    <p>До таких заходів належать шифрування, використання захищених серверів, аудит доступів та постійний моніторинг на предмет кібератак.</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**9. Зміни до Політики**</p>
                    <br />
                    <p>Портал залишає за собою право змінювати та оновлювати цю Політику у разі потреби.</p>
                    <p>Оновлена редакція набирає чинності з моменту її оприлюднення на сторінці «Обробка персональних даних».</p>
                    <br />
                    <p>---</p>
                    <br />
                    <p className='font-semibold'>**10. Контакти**</p>
                    <br />
                    <p>З усіх питань, пов’язаних з обробкою персональних даних, користувач може звернутися через розділ «Контакти» на Порталі або за відповідними контактними даними, зазначеними для рекрутингової служби."</p>
                </div>
            </div>
        </div>
    )
}

export default ProcessingData